[
  {
    "id": 1,
    "company_name": "Fellow - Senior Mobile Engineer",
    "date": "2025-10-20",
    "job_description": "At Fellow, we’re on a mission to give every employee their own AI-powered Chief of Staff, an assistant that understands your meeting discussions, surfaces key insights, answers questions, and takes action so you can focus on what matters most.\n\n\nWe're looking for a Senior Mobile Engineer to own and evolve our mobile experience across iOS and Android. You'll build and ship features that bring Fellow's AI-powered meeting intelligence to mobile users, work independently with high ownership, and ensure every release makes meetings more productive on the go.\n\n\nWhy Fellow?\n\nFellow is a remote-first, Series A startup backed by Craft Ventures, iNovia, and Felicis. Our founders previously built Fluidware (acquired by SurveyMonkey), and we’re now helping the world’s best teams—from Shopify, HubSpot, and Warner Media, to startups across the globe—make meetings more productive with the power of AI.\n\n\nAbout the Role\n\nMobile Platform Ownership: Take full ownership of our iOS and Android apps built with Capacitor, managing the entire mobile experience end-to-end.\nCross-Platform Development: Build features that work seamlessly across both platforms, leveraging web technologies through Capacitor while ensuring native-quality experiences.\nIndependent Execution: Work autonomously to define technical approach, make architectural decisions, and ship high-quality releases without heavy oversight.\nAI Tooling Advocate: Use AI-powered developer tools to accelerate development, from prototyping to debugging, and help establish mobile development best practices.\nOutcome-Oriented Delivery: Focus on features that meaningfully impact user engagement and product metrics, translating mobile-specific requirements into delightful experiences.\nCollaborative Development: Partner with Product, Design, and the full-stack engineering team to ensure mobile experiences feel native and polished.\nQuality & Performance: Implement testing strategies, monitor app performance and crashes, and maintain high standards for mobile app quality across releases.\nFramework Expertise: Dive deep into Capacitor, master its capabilities and limitations, and make informed decisions about when to use plugins versus native code.\n\n\nAbout You\n\nYou might be a great fit if you:\nHave 5+ years of development experience, with 2+ on iOS and/or Android.\nAre comfortable working independently and taking full ownership of a platform with minimal direction.\nHave a strong will to figure things out—you don't need to know Capacitor, but you're excited to learn and master new frameworks.\nThrive in fast-paced teams where you can make decisions, ship quickly, and iterate based on user feedback.\nCare deeply about mobile UX details—performance, gestures, offline behaviour, and platform conventions.\nCommunicate clearly and collaborate well across disciplines, even while working autonomously.\n\n\nBonus points if you have:\nExperience with Capacitor, Ionic, Flutter, or similar hybrid mobile frameworks.\nNative development experience in Swift/iOS or Kotlin/Android.\nExperience shipping and maintaining apps in the App Store and Google Play.\n\n\nOur Engineering Culture\n\nOn the Engineering team at Fellow we value rapid delivery, craftsmanship, and continuous learning. We ship multiple times per week, and iterate quickly while keeping reliability and polish front-of-mind. We lean on AI tools and rigorous code review to raise the bar, share knowledge through book clubs and lunch-and-learns, and unleash big ideas at our twice-yearly hackathons. Above all, we collaborate openly, give fast feedback, and celebrate wins as a team.\n",
    "heard_back": false
  }
]