{
  "config": {
    "page_limit": 2,
    "bullets": {
      "total_min": 16,
      "total_max": 24
    },
    "skills_per_category": {
      "languages": {
        "min": 5,
        "max": 8
      },
      "platforms": {
        "min": 5,
        "max": 8
      },
      "skills": {
        "min": 8,
        "max": 12
      },
      "frameworks": {
        "min": 8,
        "max": 15
      },
      "tools": {
        "min": 6,
        "max": 10
      },
      "database": {
        "min": 4,
        "max": 6
      }
    },
    "projects": {
      "min": 2,
      "max": 2,
      "note": "Space-dependent. Prioritize experience bullets over projects."
    }
  },
  "display_settings": {
    "sections": {
      "summary": {
        "enabled": true,
        "title": "Professional Summary SACHU"
      },
      "experience": {
        "enabled": true,
        "title": "Professional Experience SACHU"
      },
      "skills": {
        "enabled": false,
        "title": "Technical Skills SACHU",
        "categories": [
          "Languages",
          "Platforms",
          "Skills",
          "Frameworks",
          "Tools",
          "Database"
        ]
      },
      "education": {
        "enabled": true,
        "title": "Education SACHU"
      },
      "projects": {
        "enabled": false,
        "title": "Personal Projects SACHU"
      }
    }
  },
  "static_info": {
    "name": "NIKHIL SHANKAR CHIRAKKAL SIVASANKARAN",
    "address": "Unit 259 - 475 King Street North",
    "phone": "226-820-1762",
    "email": "nikhil.shankar.cs@gmail.com",
    "linkedin": "https://www.linkedin.com/in/nikhilshankarcs",
    "portfolio": "",
    "leetcode": "https://leetcode.com/u/user2137S/"
  },
  "summaries": [
    {
      "id": "summary_1",
      "label": "Option 1",
      "text": "Senior Android Engineer with 7+ years of professional experience building high-performance mobile applications across fintech and ad-tech domains. Architected core UPI payment systems at a fintech startup and developed SDK libraries at an ad-tech company integrated by 1000+ applications, with expertise in designing scalable architectures, optimizing app performance, and leading cross-functional initiatives. Proficient in Clean Architecture, MVI patterns, and Jetpack Compose with strong capabilities in code reviews, mentoring developers, and establishing engineering standards. Contributed to taking a startup from early stage to unicorn status through technical excellence and systematic problem-solving."
    },
    {
      "id": "summary_2",
      "label": "Option 2",
      "text": "Versatile Software Engineer with 7+ years building high-performance mobile and backend systems across Android, iOS, and microservices architectures. Architected core payment infrastructure serving 1.5M daily users, developed cross-platform SDKs integrated by 1000+ apps, and reduced system costs by 70% through optimization. Deep expertise in Kotlin, Java, Jetpack Compose and good exposure with Go, Python and Flutter, with experience scaling products from MVP to unicorn status."
    },
    {
      "id": "summary_3",
      "label": "Option 3",
      "text": "Software Engineer blending 7+ years of production mobile development with emerging AI/ML expertise. Built and scaled fintech systems serving 1.5M daily users while architecting high-performance Android applications using modern patterns and optimization techniques. Currently expanding into Applied AI/ML with hands-on experience in LLMs, NLP, vector embeddings, and model training. Strong foundation in system architecture, performance optimization (reduced costs by 70%), and taking products from MVP to scale. Seeking to bridge mobile engineering excellence with AI/ML innovation to build next-generation intelligent applications."
    },
    {
      "id": "summary_4",
      "label": "Option 4",
      "text": "Senior Android Engineer with 7+ years of experience building high-performance mobile applications across fintech and ad-tech domains. Architected core UPI payment systems at a fintech startup and developed SDK libraries at an ad-tech company integrated by 1000+ applications, with expertise in designing scalable architectures, optimizing app performance, and leading cross-functional initiatives. Proficient in Clean Architecture, MVI patterns, and Jetpack Compose with strong capabilities in code reviews, mentoring developers, and establishing engineering standards. Contributed to taking a startup from early stage to unicorn status through technical excellence and systematic problem-solving."
    }
  ],
  "skills": {
    "languages": [
      "Kotlin",
      "Java",
      "Dart",
      "Python",
      "Golang",
      "C++",
      "C#",
      "Swift",
      "Objective-C",
      "Solidity"
    ],
    "languages_mandatory": [
      "Kotlin",
      "Java",
      "Python"
    ],
    "platforms": [
      "Android Studio",
      "Firebase",
      "AWS",
      "GCM",
      "IntelliJ",
      "Goland",
      "VSCode",
      "Figma",
      "PyCharm",
      "DataGrip"
    ],
    "platforms_mandatory": [
      "Android Studio",
      "Firebase",
      "PyCharm"
    ],
    "skills": [
      "Modular code using MVVM MVI and Clean Architecture",
      "Multi Module App Design",
      "Complex UI Development using Compose",
      "UI Optimizations",
      "Designing Framework and Libraries",
      "Agile Planning",
      "OOP",
      "Design patterns",
      "Code Reviews and detecting code smells and bugs",
      "Code refactoring",
      "Deadlock detection",
      "Performance profiling",
      "Google Play Store Management",
      "Project Planning",
      "UML Diagrams",
      "Mentoring Junior Developers",
      "Flowcharts",
      "Use case diagrams",
      "Sequence diagrams",
      "Spring-boot Kotlin",
      "NLP",
      "LLMs",
      "Model Training"
    ],
    "skills_mandatory": [
      "Modular code using MVVM MVI and Clean Architecture",
      "Complex UI Development using Compose",
      "Design patterns"
    ],
    "frameworks": [
      "Android SDK",
      "NDK",
      "Jetpack Compose",
      "Retrofit",
      "OkHttp",
      "Dagger",
      "Hilt",
      "Picasso",
      "Room",
      "SQLite",
      "Coroutines",
      "Livedata",
      "Lottie",
      "Motion Layout",
      "JUnit",
      "Material Components",
      "Jetpack Libraries",
      "NDK",
      "Flutter",
      "Unity",
      "Gradle",
      "Glide",
      "Detekt",
      "Websockets",
      "Javadoc",
      "JNI",
      "Llama",
      "OLlama",
      "Langchain",
      "Langgraph",
      "HuggingFace Transformers",
      "Spring Boot Kotlin",
      "Kotlin Multiplatform",
      "Spotless"
    ],
    "frameworks_mandatory": [
      "Android SDK",
      "Jetpack Compose",
      "Retrofit",
      "Coroutines",
      "Dagger",
      "Hilt",
      "Websockets",
      "Material",
      "SQLite",
      "Components",
      "Gradle",
      "Lottie",
      "Room"
    ],
    "tools": [
      "Leak Canary",
      "AS Profiler",
      "Git",
      "Debugger",
      "Stetho",
      "Postman",
      "GPU Profiler",
      "Network Profiler",
      "Charles",
      "Benchmark Library",
      "Lint",
      "Github Actions",
      "Jira",
      "Trello",
      "Confluence",
      "Bitbucket",
      "Groq",
      "Llama"
    ],
    "tools_mandatory": [
      "Git",
      "AS Profiler",
      "Github Actions"
    ],
    "database": [
      "MySQL",
      "SQLite",
      "MongoDB",
      "Firebase Realtime",
      "Firebase Firestore",
      "Weaviate-Vector DB"
    ],
    "database_mandatory": [
      "SQLite",
      "Firebase Firestore"
    ]
  },
  "companies": [
    {
      "id": "slice",
      "mandatory": true,
      "name": "Slice, Fintech",
      "position": "Software Development Engineer 3 - Android",
      "dates": "Nov 2022 - Feb 2024",
      "location": "Bengaluru, India",
      "website": "Website",
      "playstore": "Playstore",
      "bullet_constraints": {
        "min": 4,
        "max": 7
      },
      "bullets": [
        {
          "text": "Designed core architecture for the UPI payment system using Clean Architecture and MVI, serving 1.5 million users per day as of Feb 2024.",
          "mandatory": false
        },
        {
          "text": "Refactored the complex Gradle and build files to establish a centralized baseline for dependencies, successfully isolating new module creation and preventing unexpected dependency breaks in release and production builds.",
          "mandatory": false
        },
        {
          "text": "Analyzed, profiled, and reduced network latency by ~18-20%, resulting in faster transaction completion time across the fintech app.",
          "mandatory": false
        },
        {
          "text": "Ensured quality of deliverables by mentoring Junior developers, doing extensive code reviews and walkthroughs and by helping to adhere to best coding practices.",
          "mandatory": false
        },
        {
          "text": "Optimized CI/CD settings in AWS Codebuild and Gradle files to reduce build times by 40% and cost by a huge 70%",
          "mandatory": false
        },
        {
          "text": "Adopted unit tests for modules under the UPI project, achieving 90% code coverage.",
          "mandatory": false
        },
        {
          "text": "Designed a library to create statistical graphs in Jetpack Compose seamlessly and refactored code to achieve minimal re-compositions.",
          "mandatory": false
        },
        {
          "text": "Refactored existing multi-module architecture further into data and ui modules to ensure common api's and data are not duplicated across modules thereby reducing dev effort across teams.",
          "mandatory": false
        },
        {
          "text": "Integrated detekt and spotless library to enforce coding standards across modules thereby ensuring easier code reviews",
          "mandatory": false
        },
        {
          "text": "Incorporated creation of Use Case, Flow and Class diagrams before feature implementation thereby ensuring product - engineering alignment and better clarity and guidance for junior developers",
          "mandatory": false
        },
        {
          "text": "Integrated ruler gradle plugin from Spotify to analyze and make sure apk size is under control thereby identifying and ironing out size related issues before app release",
          "mandatory": false
        }
      ]
    },
    {
      "id": "slice2",
      "mandatory": true,
      "name": "Slice, Fintech",
      "position": "Software Development Engineer 2 - Android",
      "dates": "Nov 2020 - Nov 2022",
      "location": "Bengaluru, India",
      "website": "Website",
      "playstore": "Playstore",
      "bullet_constraints": {
        "min": 4,
        "max": 5
      },
      "bullets": [
        {
          "text": "Designed and architected chat feature by integrating socket io at client side and helped architect websocket apis at backend for seamless realtime data transfer",
          "mandatory": false
        },
        {
          "text": "Developed a social media feature module as an MVP in 3 weeks to be integrated into the fintech app for A/B testing",
          "mandatory": false
        },
        {
          "text": "Designed an emoji-shower library making it easier for different teams to integrate confetti and emoji animations and reduced memory consumption by 95% by reusing image vectors",
          "mandatory": false
        },
        {
          "text": "Refactored existing fragments in the codebase thereby increasing UI performance by forcing reuse of already inflated layouts",
          "mandatory": false
        },
        {
          "text": "Identified frequent use of onboarding stories across teams and created an onboarding status library thereby reducing onboarding feature development time across teams from 1-2 days to half a day",
          "mandatory": false
        },
        {
          "text": "Identified that modular architecture was not being followed in the organization and initiated multi module architecture thereby making scaling across teams easier",
          "mandatory": false
        },
        {
          "text": "Decoupled cross-module navigation by implementing a Navigation Contract Interface in a core module and using Dependency Injection for registration, successfully eliminating tight coupling issues and circular-dependency restrictions in a scalable multi-module architecture.",
          "mandatory": false
        }
      ]
    },
    {
      "id": "greedygame",
      "mandatory": true,
      "name": "GreedyGame, Ad-Tech",
      "position": "Fullstack Developer Android, iOS, Backend",
      "dates": "Apr 2018 - Oct 2019",
      "location": "Bengaluru, India",
      "website": "Website",
      "bullet_constraints": {
        "min": 4,
        "max": 6
      },
      "bullets": [
        {
          "text": "Initiated development of the iOS plugin from scratch as a personal project by learning swift and iOS app development which was later incorporated as a separate product line in the organization attracting iOS app and game development companies into the business.",
          "mandatory": false
        },
        {
          "text": "Refactored the monolithic Backend written in NodeJS to microservices based architecture using Golang, which helped streamline the development and reduced overall development time, time for debugging issues, and time for deployment.",
          "mandatory": false
        },
        {
          "text": "Integrated Jenkins CI/CD pipeline for automating artifact creation thereby reducing previous manual effort of 2-3 hours",
          "mandatory": false
        },
        {
          "text": "Developed integration documentation website in Angular JS thereby reducing integration related queries",
          "mandatory": false
        },
        {
          "text": "Achieved 90%+ unit test coverage using Mockito after refactoring the core library, significantly enhancing the reliability and ongoing quality assurance of the SDK's essential features.",
          "mandatory": false
        }
      ]
    },
    {
      "id": "greedygame2",
      "mandatory": true,
      "name": "GreedyGame, Ad-Tech",
      "position": "Senior Developer | Android",
      "dates": "Sep 2015 - Apr 2018",
      "location": "Bengaluru, India",
      "website": "Website",
      "bullet_constraints": {
        "min": 4,
        "max": 6
      },
      "bullets": [
        {
          "text": "Developed core Android library, which other developers can integrate to show native ads, focusing on optimization and performance thereby reducing memory consumption and library conflicts",
          "mandatory": false
        },
        {
          "text": "Refactored a single monolithic codebase into multiple modules following facade, adapter, mediator design patterns, and more, applying good coding standards, reducing development time and cross team conflicts.",
          "mandatory": false
        },
        {
          "text": "Integrated Admob, Mopub and Facebook Ads and wrote wrappers for Unity Game Engine and Cocos-2dx using JNI, C#, and C++, facilitating the Android library to inject ads into games and apps thereby increasing compatible dev environment by 4x",
          "mandatory": false
        },
        {
          "text": "Ideated and designed separate settings tool app which allows to view debug logs of other games integrated with the Android library in debug mode which resulted in faster debugging and helped QA to reduce bug reporting time by at least 50%",
          "mandatory": false
        },
        {
          "text": "Created a Unity game engine plugin that reduced developers' initial integration time from 1-2 days to less than 10 minutes.",
          "mandatory": false
        }
      ]
    }
  ],
  "projects": [
    {
      "id": "momentor",
      "mandatory": true,
      "name": "Momentor: Moments worth Mentoring",
      "tech": "Android, AI/LLM Integration, Supabase, PostgreSQL, Python, Dino Edge-Functions",
      "description": "Momentor is a specialized mindfulness journaling application developed natively on Android to ensure an optimized, minimalist user experience. The Android client was engineered with a conversational interface for journaling and integrated directly with a robust serverless backend. This backend utilized Python for core logic, PostgreSQL via Supabase for secure data persistence, and Deno Edge Functions to deliver low-latency, philosophy-specific responses from the AI/LLM-powered mentors. This architecture successfully paired a high-performance Android application with advanced AI logic to deliver personalized, real-time guidance.",
      "date": "April 2025 - Current",
      "link": ""
    },
    {
      "id": "fanfight",
      "mandatory": false,
      "name": "Fan Fight Club",
      "tech": "Android, Python Scripts",
      "description": "Developed Fan Fight Club, a multi-variant Android app series using Firebase Realtime Database, featuring celebrity face-offs (Ronaldo vs Messi, Federer vs Nadal, etc.). Architected a scalable build system leveraging Android Gradle flavors and Python automation scripts to generate unique app variants from JSON configurations, enabling rapid deployment of personalized celebrity battle apps from a single codebase. One of the versions Messi Vs Ronaldo had garnered more than a 100 thousand  installs with a user review rating of 4.8/5 in playstore",
      "date": "2019",
      "link": "https://bitbucket.org/nikhilshankarcs/fanfightclub"
    },
    {
      "id": "mmdb",
      "mandatory": false,
      "name": "MMDB: My Movie Database",
      "tech": "Android, TMDB API",
      "description": "Developed MMDB (My Movie Database), a social movie review Android app integrating TMDB API for comprehensive movie data with Firebase Realtime Database for user-generated content. Built a feature-rich platform enabling users to create custom movie lists, share reviews, and engage through comments and likes, fostering an interactive movie enthusiast community.",
      "date": "July 2020",
      "link": "https://bitbucket.org/nikhilshankarcs/mmdb"
    },
    {
      "id": "wholookslikeme",
      "mandatory": false,
      "name": "WhoLooksLikeMe",
      "tech": "Python, Inception V3, Vector Embeddings",
      "description": "Built WhoLooksLikeMe, an ML-powered facial recognition system leveraging transfer learning with InceptionV3 for feature extraction and vector embeddings for similarity matching. Designed a scalable pipeline that eliminates costly retraining by storing pre-computed embeddings, allowing seamless celebrity dataset expansion, and implemented cosine similarity algorithms while benchmarking multiple pre-trained base models (FaceNet, VGGFace, InceptionV3).",
      "date": "2024 Dec",
      "link": "https://wholookslikeme.com"
    }
  ],
  "education": [
    {
      "degree": "Post-Graduate Diploma",
      "course": "Applied Artificial Intelligence & Machine Learning | Cloud Dev-Ops",
      "institution": "Conestoga College, Waterloo - Expected completion - Dec 2025",
      "dates": "Sep 2024 - Current",
      "location": "Waterloo, Ontario, Canada"
    },
    {
      "degree": "Master of Technology",
      "course": "Software Engineering",
      "institution": "CUSAT, Kerala, India",
      "dates": "Aug 2012 - Apr 2014",
      "location": "Cochin, Kerala, India"
    },
    {
      "degree": "Bachelor of Technology",
      "course": "Computer Science & Engineering",
      "institution": "CoET, Thalassery, India",
      "dates": "Aug 2007 - Apr 2011",
      "location": "Thalassery, Kerala, India"
    }
  ]
}