[
  {
    "id": 1,
    "company_name": "Firesafety",
    "date": "2025-11-01",
    "job_description": "Is keeping others safe your passion? Then we’d love to hear from you!\n\nAt Trinity Lutheran College, the safety and wellbeing of our students and staff is our highest priority. We are seeking a dedicated and conscientious Work Health & Safety (WHS) Officer to help us continue building a strong, proactive culture of care and safety across the College.\n\nReporting directly to the Chief Operating Officer, who has a genuine commitment to supporting your work, you will also collaborate closely with our Executive Team, Facilities Manager and wider leadership team to make a tangible difference.\n\nIn this pivotal role, you’ll lead and coordinate the College’s WHS functions, driving compliance, continuous improvement and a genuine safety-first mindset. Key priorities include:\n\nLeading the operation of the SRO and Risk Committees\n\nReviewing and enhancing our risk management framework, including how WHS is governed at operational, executive and Board levels\n\nProviding strategic and practical WHS advice to staff when planning a range of activities, from camps, excursions, sports carnivals, musicals and community events.\n\nReviewing and refining WHS policies and procedures\n\nImproving our emergency response frameworks\n\nBuilding a culture of practice that keeps everyone safe\n\nAbout you:\n\nYou are a natural people person - positive, warm and approachable, yet also capable of identifying risks and seeing where things could go wrong. You combine common sense and critical thinking with a calm, solutions-focused approach.  Adapt at helping others find practical and balanced ways to keep our community safe. You will also have the skills and ability to:\n\nBuild strong relationships across the College and encourage a culture of shared responsibility for safety\n\nBalance sensible risk management with streamlined, effective processes that avoid unnecessary red tape\n\nBe a trusted advisor, helping staff plan activities safely while maintaining our vibrant, engaging school environment\n\nHave the confidence to influence, educate and lead by example\n\nQualifications and Experience\n\nWe are seeking a candidate who:\n\nMeets the legislative definition of a Work Health and Safety Officer (minimum Certificate IV in Work Health and Safety – BSB41419)\n\nHas an additional certificate from the school of hard knocks\n\nAdvanced Diploma in Common Sense",
    "heard_back": false
  }
]